## pushmetrics.io plan
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_cloudwatch_event_rule.check-scheduler-event[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_rule" "check-scheduler-event" {
      [32m+[0m [0m[1m[0marn[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mdescription[0m[0m         = " cronjob schedule"
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mis_enabled[0m[0m          = true
      [32m+[0m [0m[1m[0mname[0m[0m                = "-cronjob-check-scheduler-event"
      [32m+[0m [0m[1m[0mschedule_expression[0m[0m = "cron(* * * * ? *)"
    }

[1m  # aws_cloudwatch_event_target.sns[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_cloudwatch_event_target" "sns" {
      [32m+[0m [0m[1m[0marn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mrule[0m[0m      = "-cronjob-check-scheduler-event"
      [32m+[0m [0m[1m[0mtarget_id[0m[0m = "SendToSNS"
    }

[1m  # aws_sns_topic.default[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_sns_topic" "default" {
      [32m+[0m [0m[1m[0marn[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = " cronjob"
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mpolicy[0m[0m       = (known after apply)
    }

[0m[1mPlan:[0m 3 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0marn[0m[0m = (known after apply)
  [32m+[0m [0m[1m[0mid[0m[0m  = (known after apply)
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```